{
  "admin": {
    "firstname": "Ángel",
    "lastname": "Cuervo",
    "username": "cuervolu",
    "email": "angel.cuervo187@gmail.com",
    "password": "adminPassword123!",
    "dateOfBirth": "2002-07-29",
    "countryCode": "CL",
    "gender": "MALE"
  },
  "users": [
    {
      "firstname": "Ignacio",
      "lastname": "Carrasco",
      "username": "igna.carrasco",
      "email": "igna.carrasco@duocuc.cl",
      "password": "password123!",
      "dateOfBirth": "1660-01-01",
      "countryCode": "CL",
      "gender": "PREFER_NOT_TO_SAY"
    },
    {
      "firstname": "Hamir",
      "lastname": "Llanos",
      "username": "kiwi",
      "email": "ha.llanos@duocuc.cl",
      "password": "password123!",
      "dateOfBirth": "2002-12-03",
      "countryCode": "CL",
      "gender": "MALE"
    },
    {
      "firstname": "Cristopher",
      "lastname": "Hurtado",
      "username": "crihurtado",
      "email": "cri.hurtado@duocuc.cl",
      "password": "password123!",
      "dateOfBirth": "1990-01-03",
      "countryCode": "CL",
      "gender": "MALE"
    }
  ],
  "roadmaps": [
    {
      "title": "Introducción al Mundo de la Programación",
      "description": "Embárcate en un viaje fascinante por el vasto universo de la programación. Descubre los fundamentos que dan vida a la tecnología que usamos cada día, desde los conceptos básicos de la computación hasta los primeros pasos en la creación de código. Este roadmap te guiará a través de los principios esenciales, preparándote para explorar cualquier lenguaje de programación con confianza.",
      "tags": [
        {
          "name": "Programación"
        },
        {
          "name": "Principiante"
        },
        {
          "name": "Fundamentos"
        }
      ],
      "course_ids": [
        1
      ],
      "is_published": true
    },
    {
      "title": "Café Compilado: Tu Primer Sorbo de Java",
      "description": "Sumérgete en el rico y aromático mundo de Java, uno de los lenguajes de programación más populares y versátiles. Este roadmap te llevará desde los conceptos básicos de la programación orientada a objetos hasta la creación de tus primeras aplicaciones Java. Prepárate para saborear la potencia y flexibilidad de Java mientras construyes una base sólida para tu carrera en desarrollo de software.",
      "tags": [
        {
          "name": "Java"
        },
        {
          "name": "Programación Orientada a Objetos"
        },
        {
          "name": "Desarrollo de Software"
        }
      ],
      "course_ids": [
        2
      ],
      "is_published": true
    },
    {
      "title": "Carrera de Karts Go",
      "description": "¡Acelera a través del emocionante mundo de la programación Go con nuestra aventura de Karts!",
      "tags": [
        {
          "name": "Go"
        },
        {
          "name": "Concurrencia"
        },
        {
          "name": "Rendimiento"
        }
      ],
      "course_ids": [
        3
      ],
      "is_published": true
    },
    {
      "title": "La Búsqueda del Castillo TypeScript",
      "description": "¡Conquista el castillo TypeScript y conviértete en un maestro del JavaScript tipado!",
      "tags": [
        {
          "name": "TypeScript"
        },
        {
          "name": "JavaScript"
        },
        {
          "name": "Desarrollo Web"
        }
      ],
      "course_ids": [
        4
      ],
      "is_published": true
    },
    {
      "title": "Taller de Robots Rust",
      "description": "¡Construye robots asombrosos con Rust en este divertido y educativo taller!",
      "tags": [
        {
          "name": "Rust"
        },
        {
          "name": "Programación de Sistemas"
        },
        {
          "name": "Seguridad de Memoria"
        }
      ],
      "course_ids": [
        5
      ],
      "is_published": true
    },
    {
      "title": "La Senda del Mago del DOM: Dominio de JavaScript",
      "description": "Embárcate en un viaje épico a través de La Senda del Mago del DOM. Descubrirás los secretos arcanos de JavaScript, desde la manipulación mística del DOM hasta la creación de poderosos hechizos asíncronos. Dominarás el arte de tejer aplicaciones web interactivas, conjurar APIs RESTful y forjar artefactos mágicos con frameworks modernos. Al final de tu travesía, te alzarás como un verdadero Archimago del desarrollo web front-end y full-stack.",
      "tags": [
        {
          "name": "JavaScript"
        },
        {
          "name": "Desarrollo Web"
        },
        {
          "name": "Front-end"
        },
        {
          "name": "Full-stack"
        }
      ],
      "course_ids": [
        6
      ],
      "is_published": false
    },
    {
      "title": "El Viaje del Explorador de Datos: Aventuras en Python y Machine Learning",
      "description": "Únete a una expedición fascinante a través del mundo de la ciencia de datos y el aprendizaje automático. Descubre los secretos ocultos en los datos, domina las artes de la visualización y desata el poder de los algoritmos de IA. Al final de tu viaje, te convertirás en un verdadero Explorador de Datos, capaz de revelar conocimientos asombrosos y predecir el futuro con tus habilidades de Machine Learning.",
      "tags": [
        {
          "name": "Python"
        },
        {
          "name": "Data Science"
        },
        {
          "name": "Machine Learning"
        },
        {
          "name": "Visualización de Datos"
        }
      ],
      "course_ids": [
        7
      ],
      "is_published": false
    },
    {
        "title": "Aventura en las Islas Java",
        "description": "Explora un archipiélago de conocimiento avanzado en Java, donde cada isla representa un aspecto especializado del desarrollo empresarial. Desde la creación de aplicaciones distribuidas con Spring Boot hasta la optimización de bases de datos y microservicios, esta aventura te convertirá en un verdadero maestro del ecosistema Java.",
        "tags": [
          {
            "name": "Java"
          },
          {
            "name": "Spring Boot"
          },
          {
            "name": "Microservicios"
          }
        ],
        "course_ids": [
          8
        ],
        "is_published": true
        },
        {
          "title": "Ciudad Veloz: Microservicios con Go",
          "description": "Construye una ciudad moderna usando la velocidad y eficiencia de Go. Aprende a diseñar y desarrollar microservicios escalables, APIs de alto rendimiento y sistemas distribuidos robustos. Domina las mejores prácticas de la arquitectura de software moderna mientras construyes los rascacielos del futuro.",
          "tags": [
            {
              "name": "Go"
            },
            {
              "name": "Microservicios"
            },
            {
              "name": "Arquitectura de Software"
            }
          ],
          "course_ids": [
            9
          ],
          "is_published": true
        },
        {
          "title": "Academia de Magos TypeScript: Hechizos Avanzados",
          "description": "Profundiza en los misterios más oscuros de TypeScript en esta academia de nivel avanzado. Aprende a crear tipos genéricos poderosos, domina la magia de los decoradores y descubre los secretos de la programación funcional. Gradúate como un Archimago de TypeScript capaz de construir aplicaciones empresariales robustas y seguras.",
          "tags": [
            {
              "name": "TypeScript"
            },
            {
              "name": "Programación Funcional"
            },
            {
              "name": "Patrones de Diseño"
            }
          ],
          "course_ids": [
            10
          ],
          "is_published": true
        },
        {
          "title": "La Forja del Sistema: Rust Avanzado",
          "description": "Adéntrate en las profundidades de la programación de sistemas con Rust. Desde el desarrollo de drivers y sistemas embebidos hasta la creación de herramientas de línea de comandos de alto rendimiento, esta forja te convertirá en un maestro herrero del código seguro y eficiente.",
          "tags": [
            {
              "name": "Rust"
            },
            {
              "name": "Sistemas Embebidos"
            },
            {
              "name": "Programación de Bajo Nivel"
            }
          ],
          "course_ids": [
            11
          ],
          "is_published": true
        },
        {
          "title": "La Academia de Arquitectos JavaScript",
          "description": "Únete a la élite de los arquitectos de software en esta academia especializada en patrones y arquitecturas modernas de JavaScript. Aprende a diseñar y construir aplicaciones escalables usando los últimos frameworks y técnicas de desarrollo. Domina React, Vue.js y Node.js mientras construyes el futuro de la web.",
          "tags": [
            {
              "name": "JavaScript"
            },
            {
              "name": "Arquitectura Frontend"
            },
            {
              "name": "React"
            }
          ],
          "course_ids": [
            12
          ],
          "is_published": true
        },
        {
          "title": "La Ciudadela de la IA: Python Avanzado",
          "description": "Asciende a las alturas de la inteligencia artificial en esta ciudadela del conocimiento avanzado en Python. Domina las redes neuronales profundas, el procesamiento del lenguaje natural y la visión por computadora. Conviértete en un maestro de la IA capaz de construir sistemas inteligentes que cambien el mundo.",
          "tags": [
            {
              "name": "Python"
            },
            {
              "name": "Deep Learning"
            },
            {
              "name": "Inteligencia Artificial"
            }
          ],
          "course_ids": [
            13
          ],
          "is_published": true
        }
  ],
  "courses": [
    {
      "name": "Conceptos Básicos de Computación",
      "description": "Descubre los fundamentos que hacen funcionar a las computadoras modernas. Este curso te introduce a los conceptos esenciales de la computación, desde la representación de datos hasta la lógica binaria, sentando las bases para tu viaje en el mundo de la programación.",
      "tags": [
        {
          "name": "Fundamentos"
        },
        {
          "name": "Computación"
        },
        {
          "name": "Principiante"
        }
      ],
      "is_published": true
    },
    {
      "name": "Comenzando con Java",
      "description": "Inicia tu aventura en el mundo de Java con este curso introductorio. Aprenderás la sintaxis básica, los conceptos de programación orientada a objetos y cómo crear tus primeros programas en Java. ¡Prepárate para dar tus primeros pasos en uno de los lenguajes más demandados de la industria!",
      "tags": [
        {
          "name": "Java"
        },
        {
          "name": "Programación"
        },
        {
          "name": "Principiante"
        }
      ],
      "is_published": true
    },
    {
      "name": "La Búsqueda del Tesoro Go",
      "description": "¡Únete a la emocionante búsqueda del tesoro y descubre las joyas de la programación Go!",
      "tags": [
        {
          "name": "Go"
        },
        {
          "name": "Concurrencia"
        },
        {
          "name": "Rendimiento"
        }
      ],
      "is_published": true
    },
    {
      "name": "Los Hechizos Mágicos de TypeScript",
      "description": "¡Lanza hechizos mágicos con TypeScript y encanta tus aplicaciones web!",
      "tags": [
        {
          "name": "TypeScript"
        },
        {
          "name": "JavaScript"
        },
        {
          "name": "Desarrollo Web"
        }
      ],
      "is_published": true
    },
    {
      "name": "La Fábrica de Robots Rust",
      "description": "¡Crea tus propios robots usando Rust en esta emocionante simulación de fábrica!",
      "tags": [
        {
          "name": "Rust"
        },
        {
          "name": "Programación de Sistemas"
        },
        {
          "name": "Seguridad de Memoria"
        }
      ],
      "is_published": true
    },
    {
      "name": "Grimorio del DOM: JavaScript Básico",
      "description": "Comienza tu viaje como aprendiz de mago del DOM. En este curso fundamental, aprenderás los hechizos básicos de JavaScript, desde la manipulación de elementos del DOM hasta los primeros encantamientos de eventos. Descubre cómo dar vida a tus páginas web con magia interactiva.",
      "tags": [
        {
          "name": "JavaScript"
        },
        {
          "name": "DOM"
        },
        {
          "name": "Principiante"
        }
      ],
      "is_published": true
    },
    {
      "name": "La Brújula del Científico de Datos",
      "description": "Embárcate en tu primera expedición al mundo de la ciencia de datos con Python. Aprende a navegar por datasets, crear visualizaciones básicas y descubrir patrones ocultos en los datos. Una aventura introductoria perfecta para aspirantes a científicos de datos.",
      "tags": [
        {
          "name": "Python"
        },
        {
          "name": "Data Science"
        },
        {
          "name": "Visualización"
        }
      ],
      "is_published": true
    },
    {
      "name": "Maestría en Spring Boot: El Viaje del Arquitecto Java",
      "description": "Domina el arte de construir aplicaciones empresariales robustas con Spring Boot. Desde la creación de APIs RESTful hasta la implementación de seguridad y microservicios, este curso te convertirá en un arquitecto Java consumado.",
      "tags": [
        {
          "name": "Java"
        },
        {
          "name": "Spring Boot"
        },
        {
          "name": "Arquitectura"
        }
      ],
      "is_published": true
    },
    {
      "name": "Ingeniería de Microservicios con Go",
      "description": "Construye sistemas distribuidos escalables y de alto rendimiento con Go. Aprende patrones de microservicios, manejo de concurrencia avanzada y técnicas de optimización para crear aplicaciones empresariales modernas.",
      "tags": [
        {
          "name": "Go"
        },
        {
          "name": "Microservicios"
        },
        {
          "name": "Sistemas Distribuidos"
        }
      ],
      "is_published": true
    },
    {
      "name": "Artes Oscuras de TypeScript",
      "description": "Sumérgete en los aspectos más avanzados de TypeScript. Domina tipos genéricos complejos, programación funcional avanzada y patrones de diseño modernos para construir aplicaciones empresariales robustas.",
      "tags": [
        {
          "name": "TypeScript"
        },
        {
          "name": "Avanzado"
        },
        {
          "name": "Patrones de Diseño"
        }
      ],
      "is_published": true
    },
    {
      "name": "Desarrollo de Sistemas Embebidos con Rust",
      "description": "Aprende a crear software de bajo nivel seguro y eficiente con Rust. Desde drivers hasta sistemas en tiempo real, dominarás las técnicas avanzadas de programación de sistemas.",
      "tags": [
        {
          "name": "Rust"
        },
        {
          "name": "Sistemas Embebidos"
        },
        {
          "name": "Bajo Nivel"
        }
      ],
      "is_published": true
    },
    {
      "name": "Arquitectura Frontend Moderna con React",
      "description": "Conviértete en un arquitecto frontend experto. Aprende a diseñar y construir aplicaciones React escalables, implementar patrones avanzados de estado y crear experiencias de usuario excepcionales.",
      "tags": [
        {
          "name": "JavaScript"
        },
        {
          "name": "React"
        },
        {
          "name": "Arquitectura"
        }
      ],
      "is_published": true
    },
    {
      "name": "Deep Learning y Redes Neuronales con Python",
      "description": "Explora las profundidades de la inteligencia artificial con Python. Construye y entrena redes neuronales complejas, implementa modelos de procesamiento del lenguaje natural y desarrolla sistemas de visión por computadora.",
      "tags": [
        {
          "name": "Python"
        },
        {
          "name": "Deep Learning"
        },
        {
          "name": "IA"
        }
      ],
      "is_published": true
    },
    {
      "name": "Optimización y Despliegue en Java",
      "description": "Lleva tus aplicaciones Java al siguiente nivel. Aprende técnicas avanzadas de optimización, implementación de CI/CD y estrategias de despliegue en la nube para aplicaciones empresariales.",
      "tags": [
        {
          "name": "Java"
        },
        {
          "name": "DevOps"
        },
        {
          "name": "Optimización"
        }
      ],
      "is_published": true
    },
    {
      "name": "Seguridad y Testing en Go",
      "description": "Domina las mejores prácticas de seguridad y testing en Go. Implementa pruebas automatizadas robustas y protege tus aplicaciones contra vulnerabilidades comunes.",
      "tags": [
        {
          "name": "Go"
        },
        {
          "name": "Seguridad"
        },
        {
          "name": "Testing"
        }
      ],
      "is_published": true
    },
    {
      "name": "TypeScript en el Ecosistema Node.js",
      "description": "Construye aplicaciones backend robustas con TypeScript y Node.js. Aprende a crear APIs seguras, implementar autenticación y manejar bases de datos con tipado fuerte.",
      "tags": [
        {
          "name": "TypeScript"
        },
        {
          "name": "Node.js"
        },
        {
          "name": "Backend"
        }
      ],
      "is_published": true
    },
    {
      "name": "Programación de Videojuegos con Rust",
      "description": "Crea motores de juegos eficientes y seguros con Rust. Aprende gráficos por computadora, física de juegos y optimización de rendimiento.",
      "tags": [
        {
          "name": "Rust"
        },
        {
          "name": "Videojuegos"
        },
        {
          "name": "Gráficos"
        }
      ],
      "is_published": true
    }
  ],
  "modules": [
    {
      "course_id": 1,
      "name": "Bienvenidos al mundo de la programación",
      "description": "¡Vamos a explorar el fascinante mundo de los programas de computadora.",
      "is_published": true
    },
    {
      "course_id": 2,
      "name": "Preparando la Cafetera",
      "description": "Vamos a explorar Java, un lenguaje de programación tan rico y fuerte como el mejor café espresso. Prepara tu taza favorita y acompáñanos en este viaje por el mundo de Java.",
      "is_published": true
    },
    {
      "course_id": 3,
      "name": "Pistas de Carreras de Go",
      "description": "¡Diseña y codifica pistas de carreras para aprender programación en Go!",
      "is_published": true
    },
    {
      "course_id": 4,
      "name": "La Escuela de Magos de TypeScript",
      "description": "¡Asiste a una mágica escuela de magos y aprende hechizos de TypeScript!",
      "is_published": true
    },
    {
      "course_id": 5,
      "name": "Piezas de Robot de Rust",
      "description": "¡Ensambla piezas de robot y aprende programación en Rust en el proceso!",
      "is_published": true
    },
    {
      "course_id": 6,
      "name": "El Primer Hechizo del DOM",
      "description": "Comienza tu viaje en la magia del DOM aprendiendo los encantamientos básicos para seleccionar y modificar elementos HTML. Descubre cómo dar tus primeros pasos en el control de la web.",
      "is_published": true
    },
    {
      "course_id": 7,
      "name": "El Campamento Base del Científico de Datos",
      "description": "Establece tu primer campamento en el mundo de la ciencia de datos. Aprende a configurar tu entorno Python y dar tus primeros pasos con pandas y numpy.",
      "is_published": true
    },
    {
      "course_id": 8,
      "name": "Fundamentos de Spring Boot",
      "description": "Construye los cimientos de tu conocimiento en Spring Boot. Aprende la estructura básica de una aplicación y cómo configurar tu primer proyecto.",
      "is_published": true
    },
    {
      "course_id": 9,
      "name": "Arquitectura de Microservicios",
      "description": "Descubre los fundamentos de la arquitectura de microservicios en Go. Aprende patrones de diseño y mejores prácticas para sistemas distribuidos.",
      "is_published": true
    },
    {
      "course_id": 10,
      "name": "Grimorios de Tipos Avanzados",
      "description": "Descubre los secretos de los tipos genéricos y las transformaciones de tipo en TypeScript. Aprende a crear tipos complejos y seguros.",
      "is_published": true
    },
    {
      "course_id": 11,
      "name": "Fundamentos de Sistemas Embebidos",
      "description": "Construye las bases para programar sistemas embebidos con Rust. Aprende sobre manejo de memoria segura y programación bare metal.",
      "is_published": true
    },
    {
      "course_id": 12,
      "name": "Patrones de Diseño React",
      "description": "Explora patrones avanzados de diseño en React para crear componentes reutilizables y mantenibles.",
      "is_published": true
    },
    {
      "course_id": 13,
      "name": "Fundamentos de Deep Learning",
      "description": "Construye tu primera red neuronal desde cero y comprende los conceptos fundamentales del aprendizaje profundo.",
      "is_published": true
    },
    {
      "course_id": 14,
      "name": "Optimización de JVM",
      "description": "Aprende técnicas avanzadas para optimizar el rendimiento de tus aplicaciones Java en la JVM.",
      "is_published": true
    },
    {
      "course_id": 15,
      "name": "Testing Avanzado en Go",
      "description": "Implementa estrategias completas de testing incluyendo pruebas unitarias, de integración y de rendimiento.",
      "is_published": true
    }
  ],
  "lessons": [
    {
      "module_id": 1,
      "name": "¿Qué es un programa?",
      "content_file": "leccion_1_que_es_un_programa.md",
      "credits": 10,
      "is_published": true
    },
    {
      "module_id": 1,
      "name": "Pensando como un Programador",
      "content_file": "leccion_2_pensando_como_programador.md",
      "credits": 15,
      "is_published": true
    },
    {
      "module_id": 1,
      "name": "El Gran Desfile de los Lenguajes de Programación",
      "content_file": "leccion_3_lenguajes_programacion.md",
      "credits": 20,
      "is_published": true
    },
    {
      "module_id": 1,
      "name": "Python: La Serpiente Amistosa del Código",
      "content_file": "leccion_4_python_la_serpiente_amistosa_del_codigo.md",
      "credits": 25,
      "is_published": true
    },
    {
      "module_id": 1,
      "name": "El Zoo de los Datos y la Ciudad de la Memoria",
      "content_file": "leccion_5_el_zoo_de_los_datos_y_la_ciudad_de_la_memoria.md",
      "credits": 30,
      "is_published": true
    },
    {
      "module_id": 1,
      "name": "¡Conviértete en un Mago del Código con tu Propio Juego de Preguntas y Respuestas!",
      "content_file": "leccion_6_¡conviertete_en_un_mago_del_codigo_con_tu_propio_juego_de_preguntas_y_respuestas.md",
      "credits": 35,
      "is_published": true
    },
    {
      "module_id": 2,
      "name": "¿Qué es Java y por qué es tan popular?",
      "content_file": "leccion_1_¿que_es_java_y_por_que_es_tan_popular.md",
      "credits": 25,
      "is_published": true
    },
    {
      "module_id": 2,
      "name": "Tu Primera Taza de Java",
      "content_file": "leccion_2_tu_primera_taza_de_java.md",
      "credits": 20,
      "is_published": true
    },
    {
      "module_id":2,
      "name": " Los Granos del Lenguaje",
      "content_file": "leccion_3_los_granos_del_lenguaje.md",
      "credits": 30,
      "is_published": true
    },
    {
      "module_id": 2,
      "name": "El Café de la Programación",
      "content_file": "leccion-1-Preparando-la-Cafetera.md",
      "credits": 35,
      "is_published": true
    },
    {
      "module_id": 2,
      "name": "Tu primer proyecto java",
      "content_file": "leccion-2-Java-para-Ninos.md",
      "credits": 40,
      "is_published": true
    },
    {
      "module_id": 3,
      "name": "Jugando con python",
      "content_file": "leccion-1-Curso-Python-para-niños.md",
      "credits": 40,
      "is_published": true
    },
    {
      "module_id": 3,
      "name": "Explorando el mundo de python",
      "content_file": "leccion-2-Aventuras-y-Maravillas-de-python-.md",
      "credits": 40,
      "is_published": true
    },
    {
      "module_id": 4,
      "name": "La cocina de TypeScript",
      "content_file": "leccion-1-Cocinando-con-TypeScript.md",
      "credits": 40,
      "is_published": true
    },
    {
      "module_id": 4,
      "name": "Masterizando la cocina de TypeScript",
      "content_file": "leccion-2-Recetas-de-TypeScript.md",
      "credits": 40,
      "is_published": true
    },
    {
      "module_id": 5,
      "name": "Aventuras galacticas en Rust",
      "content_file": "leccion-1-Los-super-heroes-rust.md",
      "credits": 40,
      "is_published": true
    },
    {
      "module_id": 5,
      "name": "Super heroes de rust",
      "content_file": "leccion-2-Aventuras-con-rust.md",
      "credits": 40,
      "is_published": true
    },
    {
      "module_id": 6,
      "name": "Explorando el cosmos con go",
      "content_file": "leccion-1-go-la-ardilla-amigable.md",
      "credits": 40,
      "is_published": true
    },
    {
      "module_id": 6,
      "name": "Aprendiendo del espacio junto a go",
      "content_file": "leccion-2-Aventuras-espaciales-en-go.md",
      "credits": 40,
      "is_published": true
    }
  ]
}